misc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-05-11 Mon 09:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Miscellaneous</title>
<meta name="keywords" content="Christoph Schottmueller links" />
<meta name="generator" content="Org Mode" />
<link rel="icon" href="./icons/favicon.webp">
<link rel="stylesheet" href="./css/stylesheet.css">
</head>
<body>
<div id="preamble" class="status">
<div id="preamble" class="status">
  <div class="banner">
<ul class="menu">
 <li class="inmenu"> <a class="lmenu" id="subtitle" href="./index.html">Home</a></li>
 <li class="inmenu"> <a class="lmenu" id="subtitle" href="./research.html">Research</a></li>
 <li class="inmenu">   <a class="lmenu" id="subtitle" href="./misc.html">Misc</a>  </li>
 <li class="dropdown"> <a class="lmenu" id="subtitle" href="./teaching.html">Teaching</a>
   <div class="dropdown-content">
      <a href="./micromsc.html">Microeconomics (MSc)</a>
      <a href="./advmicro.html">Advanced Microeconomics (MER)</a>
      <a href="./infostrat.html">Information and Strategy</a>
      <a href="./project.html">Project (BSc)</a>
      <a href="./infohealth.html">Imperfect Information in Health Care Markets</a>
      <a href="./thesis_guidelines.html">Thesis Supervision</a>
    </div>
 </li>
</ul>
   <span> </span>

    </div>
  </div>
  
<hr style="clear:both;margin-bottom: 0.4cm; margin-top: -1cm"/>
</div>
<div id="content" class="content">
<div id="outline-container-org821a129" class="outline-2">
<h2 id="org821a129">Academic Links</h2>
<div class="outline-text-2" id="text-org821a129">
</div>
<div id="outline-container-orgdf29a58" class="outline-3">
<h3 id="orgdf29a58">Institutions I am/was affiliated with:</h3>
<div class="outline-text-3" id="text-orgdf29a58">
<ul class="org-ul">
<li><a href="https://economics.uni-koeln.de/en/">University of Cologne</a></li>
<li><a href="http://www.econ.ku.dk/english/">Department of Economics, University of Copenhagen</a></li>
<li><a href="http://www.tilburguniversity.edu/about-tilburg-university/schools/economics-and-management/organisation/departments/economics/">Department of Economics, Tilburg University</a></li>
<li><a href="http://www.tilburguniversity.edu/research/institutes-and-research-groups/tilec/">TILEC</a> (Tilburg Law and Economics Center)</li>
</ul>
</div>
</div>
<div id="outline-container-orgcc37d85" class="outline-3">
<h3 id="orgcc37d85">Coauthors:</h3>
<div class="outline-text-3" id="text-orgcc37d85">
<ul class="org-ul">
<li><a href="https://janboone.github.io/homepage/">Jan Boone</a></li>
<li><a href="https://mariusgramb.github.io/%20">Marius Gramb</a></li>
<li><a href="http://olejann.net/">Ole Jann</a></li>
<li><a href="http://www.johanlagerlof.com/">Johan Lagerlöf</a></li>
<li><a href="http://prufer.net/">Jens Prüfer</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2908a48" class="outline-2">
<h2 id="org2908a48">Software and IT</h2>
<div class="outline-text-2" id="text-org2908a48">
<p>
Some useful links:
</p>
<ul class="org-ul">
<li>For graphs, I use the <a href="http://www.ctan.org/tex-archive/graphics/pgf/">tikz</a> package. Jacques Crémer has written an excellent <a href="http://cremeronline.com/LaTeX/minimaltikz.pdf">mini-introduction</a> to tikz. <a href="http://www.hackenberger.at/blog/ktikz-editor-for-the-tikz-language/">qtikz</a> is a nice little software that makes graph creation with tikz even simpler by providing some WYSIWYG feeling.</li>
<li>For writing games in LaTeX, the packages provided by <a href="http://www.economics.utoronto.ca/osborne/latex/">Martin Osborne</a> are helpful.</li>
<li>For some of my papers, I used <a href="https://julialang.org">julia</a> for numerical analysis. You can find ressources to learn Julia at <a href="https://julialang.org/learning/">https://julialang.org/learning/</a>. (In the past, I also used <a href="https://www.python.org/">python</a>.)</li>
<li>Emacs links: 
<ul class="org-ul">
<li>A blog <a href="http://www.macs.hw.ac.uk/~rs46/posts/2014-01-13-mu4e-email-client.html">post</a> describing how to set up email on Emacs.</li>
<li>A <a href="https://cestlaz.github.io/stories/emacs/">series</a> of blog posts and videos on learning Emacs step by step.</li>
</ul></li>
</ul>
</div>
<div id="outline-container-orgb4d5c34" class="outline-3">
<h3 id="orgb4d5c34">Python code game theory</h3>
<div class="outline-text-3" id="text-orgb4d5c34">
<p>
I have written some python code to solve school choice matching problems as well as some simple programs to solve finite strategic form games of complete information. Both can be found on <a href="https://github.com/schottmueller/gametheory">github</a>. Neither is computationally fast as both were only made for teaching purposes. Check the .org files as they contain lots of explanations.
</p>
</div>
</div>
</div>
<div id="outline-container-org56ea7ac" class="outline-2">
<h2 id="org56ea7ac">Presentations</h2>
<div class="outline-text-2" id="text-org56ea7ac">
<ul class="org-ul">
<li>Economics of Privacy <a href="./files/misc/slides3.odp">slides</a></li>
<li>Hart "A theory of firm scope" QJE 2010 <a href="./files/misc/IO_reading_group_Hart.pdf">slides</a></li>
<li>Segal/Whinston "Robust Predictions for Bilateral Contracting with Externalities" <a href="./files/misc/segal_whinston_robust_presentation.pdf">slides</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">

<hr style="clear:both;margin-top: -0cm;"/>

<div style="text-align: right;margin-top:-0.1cm">
  <a href="https://schottmueller.github.io/disclaimer.html"> <small>Disclaimer</small> </a>
</div>
</div>
</body>
</html>
